//확률론 문제인데 KOI 느낌이 났음.

#include <bits/stdc++.h>
using namespace std;

double arr[10][10];
double A[10]; //i번 선수가 4강전에 올라올 확률
double B[10];
double C[10];

//01 02 03 04 05 06 07
//XX 12 13 14 15 16 17
//XX XX 23 24 25 26 27
//XX XX XX 34 35 36 37
//XX XX XX XX 45 46 47
//XX XX XX XX XX 56 57
//XX XX XX XX XX XX 67

//1라운드
// 0 VS 1
// 2 VS 3
// 4 VS 5
// 6 VS 7

//2라운드
// (0 vs 1) VS (2 vs 3)
// (4 vs 5) VS (6 vs 7)

//3라운드
// ((0 vs 1) vs (2 vs 3)) VS ((4 vs 5) vs (6 vs 7))

int main(){
    for(int i=0;i<=6;i++){
        for(int j=i+1;j<=7;j++){
            double x; cin>>x;
            arr[i][j] = x/100;
            arr[j][i] = 1 - arr[i][j];
        }
    }

    A[0] = arr[0][1];
    A[1] = arr[1][0];
    A[2] = arr[2][3];
    A[3] = arr[3][2];
    A[4] = arr[4][5];
    A[5] = arr[5][4];
    A[6] = arr[6][7];
    A[7] = arr[7][6];

    B[0] = A[0]*(A[2]*arr[0][2] + A[3]*arr[0][3]); //0이 2라에 올라왔고  * (상대로 2가 올라와서 이겼거나 + 상대로 3이 올라와서 이겼거나)
    B[1] = A[1]*(A[2]*arr[1][2] + A[3]*arr[1][3]); //1이 2라에 올라왔고  * (상대로 2가 올라와서 이겼거나 + 상대로 3이 올라와서 이겼거나)
    B[2] = A[2]*(A[0]*arr[2][0] + A[1]*arr[2][1]);
    B[3] = A[3]*(A[0]*arr[3][0] + A[1]*arr[3][1]);
    B[4] = A[4]*(A[6]*arr[4][6] + A[7]*arr[4][7]);
    B[5] = A[5]*(A[6]*arr[5][6] + A[7]*arr[5][7]);
    B[6] = A[6]*(A[4]*arr[6][4] + A[5]*arr[6][5]);
    B[7] = A[7]*(A[4]*arr[7][4] + A[5]*arr[7][5]);

    C[0] = B[0]*(B[4]*arr[0][4] + B[5]*arr[0][5] + B[6]*arr[0][6] + B[7]*arr[0][7]);
    C[1] = B[1]*(B[4]*arr[1][4] + B[5]*arr[1][5] + B[6]*arr[1][6] + B[7]*arr[1][7]);
    C[2] = B[2]*(B[4]*arr[2][4] + B[5]*arr[2][5] + B[6]*arr[2][6] + B[7]*arr[2][7]);
    C[3] = B[3]*(B[4]*arr[3][4] + B[5]*arr[3][5] + B[6]*arr[3][6] + B[7]*arr[3][7]);
    C[4] = B[4]*(B[0]*arr[4][0] + B[1]*arr[4][1] + B[2]*arr[4][2] + B[3]*arr[4][3]);
    C[5] = B[5]*(B[0]*arr[5][0] + B[1]*arr[5][1] + B[2]*arr[5][2] + B[3]*arr[5][3]);
    C[6] = B[6]*(B[0]*arr[6][0] + B[1]*arr[6][1] + B[2]*arr[6][2] + B[3]*arr[6][3]);
    C[7] = B[7]*(B[0]*arr[7][0] + B[1]*arr[7][1] + B[2]*arr[7][2] + B[3]*arr[7][3]);

    for(int i=0;i<8;i++){
        printf("%.25f ",C[i]);
    }
    return 0;
}
